# GridBubbleEndn1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridBubbleEndn1 Property
ParameterTypeId Class See Also
---
"Plan View Symbols End 1 (Default)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridBubbleEndn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridBubbleEndn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridBubbleEndn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace